In [2]:
import pandas as pd
import numpy as np
from numpy.random import randint

In [3]:
columns= ['W', 'X', 'Y', 'Z'] # four columns
index= ['A', 'B', 'C', 'D', 'E'] # five rows

In [4]:
np.random.seed(42)
data=randint(-100,100,(5,4))

In [5]:
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [6]:
df=pd.DataFrame(data,index,columns)

In [7]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [8]:
df['W']

A     2
B     6
C     2
D    16
E    30
Name: W, dtype: int32

In [9]:
df['Y']

A    -8
B    88
C   -26
D     3
E   -48
Name: Y, dtype: int32

In [10]:
type(df['Y'])

pandas.core.series.Series

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
df[['W','Z']]

    W   Z
A   2 -86
B   6 -80
C   2 -13
D  16  51
E  30 -99

## Creating a new column

In [19]:
df['new']=df['W'] + df['Y']

In [20]:
df

    W   X   Y   Z  nes  new
A   2  79  -8 -86   -6   -6
B   6 -29  88 -80   94   94
C   2  21 -26 -13  -24  -24
D  16  -1   3  51   19   19
E  30  49 -48 -99  -18  -18

## Removing Columns

In [21]:
df.drop("new",axis=1)

    W   X   Y   Z  nes
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [22]:
df

    W   X   Y   Z  nes  new
A   2  79  -8 -86   -6   -6
B   6 -29  88 -80   94   94
C   2  21 -26 -13  -24  -24
D  16  -1   3  51   19   19
E  30  49 -48 -99  -18  -18

In [23]:
df=df.drop('nes',axis=1)

In [24]:
df

    W   X   Y   Z  new
A   2  79  -8 -86   -6
B   6 -29  88 -80   94
C   2  21 -26 -13  -24
D  16  -1   3  51   19
E  30  49 -48 -99  -18

In [25]:
df=df.drop('new',axis=1)

## Working with Rows

In [27]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [29]:
df.loc['A']

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [31]:
df.loc[['A','C']]

   W   X   Y   Z
A  2  79  -8 -86
C  2  21 -26 -13

In [32]:
df.iloc[0]

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [33]:
df.iloc[0:2]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

In [34]:
df.drop('C',axis=0)

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
D  16  -1   3  51
E  30  49 -48 -99

In [35]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [36]:
df.loc[['A','C'],['W','Y']]

   W   Y
A  2  -8
C  2 -26

In [37]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [38]:
df>0

      W      X      Y      Z
A  True   True  False  False
B  True  False   True  False
C  True   True  False  False
D  True  False   True   True
E  True   True  False  False

In [39]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [40]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [41]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [42]:
df[df['X']>0]['Y']

A    -8
C   -26
E   -48
Name: Y, dtype: int32

In [43]:
df[df['X']>0][['Y','Z']]

    Y   Z
A  -8 -86
C -26 -13
E -48 -99

In [44]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [47]:
df.reset_index()

  index   W   X   Y   Z
0     A   2  79  -8 -86
1     B   6 -29  88 -80
2     C   2  21 -26 -13
3     D  16  -1   3  51
4     E  30  49 -48 -99

In [48]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99